Revit 2026 API

# TransactionGroupSetName Method

---

Sets the transaction group's name.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetName(
	string name
)
```
```vb
Public Sub SetName (
	name As String
)
```
```cpp
public:
void SetName(
	String^ name
)
```
```fsharp
member SetName :
        name : string -> unit
```

#### Parameters

name String
     A name for the transaction group.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Transaction group only needs a name if it is going to be assimilated at the end.

#### Reference

TransactionGroup Class

Autodesk.Revit.DB Namespace